package hw13;
//Интерфейс Инструмент
//Создать интерфейс Инструмент и реализующие его классы Гитара, Барабан и Труба.
//Интерфейс Инструмент содержит метод play() и переменную String KEY ="До мажор".
//Гитара содержит переменные класса количествоСтрун, Барабан - размер, Труба - диаметр.
//Создать массив типа Инструмент, содержащий инструменты разного типа.
//В цикле вызвать метод play() для каждого инструмента, который должен выводить строку
// "Играет такой-то инструмент, с такими-то характеристиками".

public interface Инструмент {
    String KEY="До мажор";
    public void play();
}
